<?php

/**
 * Namodg - Ajax contact form
 *
 * @author Maher Salam <admin@namodg.com>
 * @version 1.3
 * @copyright Copyright (c) 2010, Maher Salam
 *
 * Dual licensed under the MIT and GPL licenses:
 *   @license http://www.opensource.org/licenses/mit-license.php
 *   @license http://www.gnu.org/licenses/gpl.html
 */

/****************************************************************
الخيارات الأساسية - الرجاء تعديل الخيارات التالية ليعمل السكربت
/***************************************************************/

// أيميل مستلم الرسالة - أيميل صاحب الموقع في أغلب الاحيان
$config['recieverEmail'] = "recieve@localhost";

// المفتاح الخاص بسكربتك - الرجاء التوجه للصفحة التالية للحصول على مفتاحك
// http://namodg.com/keys
$config['salt'] = '';


/****************************************************************
الخيارات الإضافية - خيارات تخصيص السكربت
/***************************************************************/

// عنوان صفحة السكربت الرئيسية
$config['homeTitle'] = 'تواصل معنا';

// عنوان الرسالة المستلمة - قم بتغييره [ فقط ] إن كنت تريد تغيير العنوان الإفتراضي
$config['messageTitle'] = '';


/****************************************************************
الخيارات المتقدمة - الرجاء عدم تعديلها إلا إذا كنت تعلم جيداً ما تعمله 
/***************************************************************/

// إن كنت تريد أن تصلك الرسالة من بريد المرسل، قم بتفعيل هذا الخيار - في كثير من الاحيان تفعيل هذا الخيار يجعل الرسائل تصل كسبام
$config['emailFromSender'] = false;

// لغة السكربت - الخيار غير فعال حالياً بشكل كامل و تم إضافته كحجر أساس لهذه الميزة في المستقبل
$config['language'] = 'ar';

// تفعيل المعالجة الآنية للطلبات
$config['ajaxEnabled'] = true;